from nlp import searching_phrase

phrase = """Капитальный ремонт автомобильной дороги"""

text = """КОМИТЕТ ПРАВИТЕЛЬСТВА ЧЕЧЕНСКОЙ РЕСПУБЛИКИ ПО ОХРАНЕ И ИСПОЛЬЗОВАНИЮ КУЛЬТУРНОГО НАСЛЕДИЯ (КЛОКИ)КУЛЬТУРИН Т1АЬХЬАЛО 1АЛАШЪЯРАН А, ПАЙДАЭЦАРАН А НОХЧИЙН РЕСПУБЛИКИН ПРАВИТЕЛЬСТВОН КОМИТЕТДиректоруООО «КАББАЛКГИПРОТРАНС» А С. САЛАТОВУ364020 г. Грозный, ул. Деловая, д. 19/65 Тел./факс (8712) 22-58-17 e-mail: nasledie-95@mail.ru http:// naslediecfir.ru 0КП091777421. ОГРН 10820310.06540М- № ^/уна № от ____Уважаемый Андарбек Султанович!На Ваш исх. № 467-ЧР от 18.05.2019г. о наличии/отсутствии объектов культурного наследия в зоне разработки проектной документации по объектам:- «Капитальный ремонт автомобильной дороги Р-215 Астрахань- Кочубей-Кизляр-Махачкала, подъезд к г. Грозный на участке км 54+477-км 70+127, Чеченская Республика»;- «капитальный ремонт автамобильной дороги Р-215 Астрахань-Кочубей- Кизляр-Махачкала, подъезд к г. Грозный на участке км 70+127- км 85+267, Чеченская Республика»;расположенным на земельных участках с кадастровыми номерами: 20:15:0000000:7840; 20:15:0000000:7839; 20:15:0000000:7838 в Шелковском муниципальном районе Чеченской Республики (согласно карты-схемы проектируемых участков) сообщаю, что по данным историко-архивных и библиографических источников, перечня объектов культурного наследия, состоящих на учете и государственной охране в Чеченской Республике, а также списков выявленных объектов культурного наследия, на указанной территории нет объектов культурного наследия (памятников истории и культуры), включенных в единый государственный реестр, выявленных объектов культурного наследия, зон их охраны и защитных зон, объектов, обладающих признаками объектов культурного наследия, а также земель, отнесенных к категории историко- культурного назначения.В соответствии со ст.36 Федерального Закона от 25 июня 2002 г. 73- ФЗ «Об объектах культурного наследия (памятников истории и культуры) народов Российской Федерации», в случае обнаружения в ходе проводимых работ признаков объектов культурного (археологического) наследия (фрагменты керамики, костные останки и др.) необходимо приостановить все работы на данном участке и сообщить об этом в Комитет /Правительства Чеченской Республики по охране и использованию культурного цаследия./ А / *% j В] f) tf\ 1 / / /Председатель /> Iffl/LIlf] iА/Ук I У И.Р. Молочаев"""

def check_matches(phrase, text):
    matches, doc = searching_phrase(phrase, text)
    result = {
        "full_match": [],
        "non_identical_match": []
    }
    for match_id, start, end in matches:
        if doc[start: end].text == phrase:
            result["full_match"].append([start, end])
        else:
            result["non_identical_match"].append([start, end])
    
    print(result)

if __name__ == "__main__":
    check_matches(phrase, text)